#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/sl-test/test-cloudflare/runs/run-7SE17kuGCpXMWTDQ

Waiting for the plan to start...

Terraform v1.2.9
on linux_amd64
Initializing plugins and modules...
cloudflare_record.www: Refreshing state... [id=e359c65babe00a22b0978442db04fd90]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # cloudflare_record.testc3icd will be created
  + resource "cloudflare_record" "testc3icd" {
      + created_on  = (known after apply)
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "testc3icd"
      + proxiable   = (known after apply)
      + proxied     = true
      + ttl         = (known after apply)
      + type        = "A"
      + value       = "203.12.13.111"
      + zone_id     = "93be47cd9bf8560c9826cb1c012afbfa"
    }

  # cloudflare_record.www will be created
  + resource "cloudflare_record" "www" {
      + created_on  = (known after apply)
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "testcicd"
      + proxiable   = (known after apply)
      + proxied     = true
      + ttl         = (known after apply)
      + type        = "A"
      + value       = "203.12.13.111"
      + zone_id     = "93be47cd9bf8560c9826cb1c012afbfa"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "CF_API_TOKEN" but a
│ value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-7SE17kuGCpXMWTDQ/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

```

</details>

*Pushed by: @sergio-ra, Action: `pull_request`*